function load_fonts() {
	var alpbig = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
	var alpsm = string_lower(alpbig)
	var numb = "0123456789"
	var dumb = "!\"#$%&'()*+,-./"
	var dumb2 = ":;<=>?@"
	var fun = dumb + numb + dumb2 + alpbig
	
	var ascii = " 々" + fun + "[" + string("\"") + "]^_`" + alpsm + "{|}~¡¢£¥¦§¨©ª«¬­®°±´µ¶·¸º»¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ～"
	var asciialt = "々 " + fun + "[" + string("\"") + "]^_`" + alpsm + "{|}~¡¢£¥¦§¨©ª«¬­®°±´µ¶·¸º»¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ～"
	var asciishort = " !\"$'()+,-./" + numb + ":;<=>?" + alpbig + "[" + string("\"") + "]_`" + alpsm + "|­"
	var jap = " " + fun + "[¥]^_‘" + alpsm + "{|}⁻Д―’“”…※←↑→↓∀∞☆♪　、。々「」『』ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをん゛゜ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶ・ー一万丈三上下不与世両並中丸主乗乱乳了予争事二互人今介仕他付代令以仮仰仲件任休会伝伸似低住体何余作使例価係保信修個倍倒候借値偉停側偶偽傑備傭傷傾働僧儀優元充先光免入全公共兵具内円再冒写冠冶冷凝凶出刀分切刊初判別利到制刺刻則削前割創力加劣助努労効勇勉動勝募勢包化北匹十千半卒協南単博占危即却卵厄原厳去参友反収取受口古叫召可台右号司合同名吐向君否吸吹告周呪味呼命咆和咲品員哮唯唱商問嗚器噴囚四回団困囲図固国園土圧在地均坊垂型埋城基報場増壁壊壌士声売変外多夢大天夫央失奥奨奪女好妄妙始姿娘嫌嫡子字存孤学守安完官定宝実客宮家宿寂寄寝対封尊小少就尽居屈届屋属崩左巨差己巻希帝師帯帰常帽幅幕平年幸幾広床序底店度座庭廃廷建式引弱張強弾当形彫影役彼待律後徒従得御復心必志忘応忠念怒怖思急性怪恐恩息悔悟悩悪悲情意愚愛感慈態慣慮憎懐成戦所手才打払技投抜択押担拒招拠持指挑振捕捜捨授掘採探接控描援損撃操支攻放救敗教散数敵文料断新方旅族日早昆昇明易昔星昼時晩普景暇暗暮暴曲更書替最月有服望朝期木未末本束来杯東板果枝枠柄染柔栄校株核根格案棄森検業極楽構様標権横機欠次欲歌歓止正武歩歯死殊残殴段殺殿母毎毒比毛民気水永求汚決油治況泉法波泣注泰活流浮浴浸消涙液淡深淵済減温測満源準滅滝演潔激濃火灯災炭点焉無然焼煙照熱燃爆父片版牛牢物特状狙独狭獄獲玉王現球理甘生産用由男町画界略番異疲痛発登白的皆皮盗盤目盲直相盾看真眠着瞬瞳知短石砕砲破確示礼社祈祝神禁秀私秒秘称移程積穏穴究空突立端競笑符筆等筋答算箱節範築簡粉精糸系約納紙級素索紹終組経結給絵絶続綿緑線編練縁罪置罰美義習翻老考者耳聖聞聴職肉肌肢胃背胞胴胸能脈脚脱腕腹膨臣自興舌舐舞般色花苦英茂茶荒菓菜落葉葬薄虚虫血行術衡表装裏製複要覆見規視覚親解触言計討訓記訪設許訳証試詩詰話誇認誓誕語誠説読誰調談論謁謝識譚警議護象負財貨販責貴買貸費賃資賊賛賞賢質購贈赤走起超越趣足距跡路踏身車軍転軽較輝輩辛辞辱込迎近返迫迷追退逃逆透逐途這通逞速造連週進遂遅遊運過道達違遠適遭選邪郎部配酵酷重野量金釜鉄銀銃鍛鎖鑑長閉開閑間関闇闘防阻降限陛険隊階際隠雄集雇雑離難雰電青静面革音響頃順預領頭頼題額顔願風飛食飲飼飽香駆駒騎騒験驚高髪魂魅魔鳥鳴黒黙鼓鼻！％＆（）＊／０１２３４５６７８：？ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ～ｬｮｯｰｱｶｺｼｽｾｿﾀﾁﾃﾅﾉﾊﾋﾍﾏﾐﾒﾖﾗﾜﾝﾞﾟ"
	var jap2 = " " + fun + "[¥]^_‘" + alpsm + "{|}⁻´Д-―❝❞…※←→∀∞☆♪、。々「」『』【】ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばばひびぴふぶぷへぺぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをん“゜ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチチッツヅテデトドナニヌネノハバパヒビピフププへヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴォヵヶ•ー一七三上下不世並中予争事二交人今他伏位体何作使例係促個倒健備優元兄先光入全八共写处出分列初判別到前力加勇動勝化北匹十印原去参及友取受口可史合同名向呪味呼命咲品四回団困図国圧在地坊型場壊士変外大天失奏奧奪女始威子字存学完定宝実室家対封導小局届屋山岩崩差市師幅年底店度康廊式弱強弹当彼待後得復心必忍念怖思急怪恐悟恶情惑意愚感懸成我戦戻所扉手才打払抗抜択抱押担拍持指挑捨掃提撃操攻故敗数敵文新方族曰｜日早明時景更書最月望期木未末本東果校根案植極機次歩歯歴死殊残段民気水永求決況法注活派浴海消深淵済涉満滅漢火灰災点無然照爆版物特犬犯状独獲王現理生用由町画界発百的皮直真眠知石研破確礼秀私科秒移税種究突立端系級終結絶続綠編練罪翻翼者耐肉肩背能脅膚自臭與舌舖舞舵色花草落葉葬蘇蛇行術製襲西要見視解触言計設訳語読調謁議財買賢赤起足踏軽込近返迷追逃途進運過道達遠選鐘長閉開間関闇降除階障集離青非面音響願類飛食駆魂魔鳴！＃＄％＆（）＊／１２３４５：；＝？ＢＣＥＦＧＫＬＭＮＯＲＳＶＸＺ`ｄｆｇｍｑｒｔｗｙ～ｭｮﾂｰｱｨｶｷｸｹｺｼｽｾﾀﾁﾂﾃﾄﾅﾆﾈﾉﾊﾌﾍﾏﾐﾑﾒﾓﾔﾕﾖﾗﾙﾚﾛﾜﾝﾞﾟ微整"
	var jap3 = " " + fun + "[¥]^_'" + alpsm + "{|}⁻ぁあぃいぅうぇえぉおかがきざくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをん“゜ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプへベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴヵヶ•ー"

	/*

		REFERENCE FOR CHANGING FONTS
		
		FONT 0,0 = BATTLE
		FONT 0,1 = BATTLE (JP)
		FONT 1,0 = MENU
		FONT 1,1 = MENU (JP)
		FONT 2,0 = DIALOGUE
		FONT 2,1 = DIALOGUE (JP)
		FONT 3,0 = DESC
		FONT 3,1 = DESC (JP)
		FONT 4,0 = MARS
		FONT 5,0 = HURT
		FONT 6,0 = UNDERTALE LOGO
		FONT 7,0 = HP
		FONT 7,1 = HP (MORE SPACED)
		FONT 8,0 = SANS
		FONT 9,0 = PAPYRUS
		FONT 10,0 = WINGDINGS
		FONT 11,0 = JAPANESE (MORE SPACED)
	*/

	global.FONT[0,0] = font_add_sprite_ext(MAIN_bitmap,ascii,1,2)
	global.FONT[1,0] = font_add_sprite_ext(MAIN_bitmap,asciialt,1,1)
	global.FONT[2,0] = font_add_sprite_ext(DIAL_bitmap,ascii,0,1)
	global.FONT[3,0] = font_add_sprite_ext(SMALL_bitmap,asciishort,0,1)
	global.FONT[4,0] = font_add_sprite_ext(SMALLER_bitmap," " + alpbig + numb + "/.",1,1)
	global.FONT[5,0] = font_add_sprite_ext(HURT_bitmap,numb + alpbig + "!?.",1,2)
	global.FONT[6,0] = font_add_sprite_ext(UT_bitmap,alpsm + alpbig,1,6)
	global.FONT[7,0] = font_add_sprite_ext(HP0_bitmap,alpbig + "KR",1,2)
	global.FONT[8,0] = font_add_sprite_ext(SANS_bitmap,ascii,0,2)
	global.FONT[9,0] = font_add_sprite_ext(PAPS_bitmap,ascii,1,2)
	global.FONT[10,0] = font_add_sprite_ext(WING_bitmap,ascii,1,2)
	global.FONT[11,0] = font_add_sprite_ext(EXIT_bitmap,alpbig,1,2)

	global.FONT[0,1] = font_add_sprite_ext(JAP0_bitmap,jap,0,-2)
	global.FONT[1,1] = font_add_sprite_ext(JAP0_bitmap,jap,1,1)
	global.FONT[1,2] = font_add_sprite_ext(JAP0_bitmap,jap,1,3)
	global.FONT[2,1] = font_add_sprite_ext(JAP1_bitmap,jap2,1,2)
	global.FONT[3,1] = font_add_sprite_ext(JAP2_bitmap,jap3,1,1)
	global.FONT[7,1] = font_add_sprite_ext(HP0_bitmap,alpbig + "KR",1,3)

	global.FONT[2,2] = font_add_sprite_ext(DIAL_bitmap,ascii,1,1)
}